{"keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "embeddings_regularizer": null, "trainable": true, "output_dim": 128, "name": "embedding_24", "dtype": "float32", "mask_zero": false, "input_dim": 345, "embeddings_constraint": null, "input_length": 15, "activity_regularizer": null, "batch_input_shape": [null, 15]}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "GRU", "config": {"bias_regularizer": null, "units": 128, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "implementation": 1, "name": "gru_150", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "recurrent_constraint": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "dropout": 0.0, "activation": "tanh", "recurrent_regularizer": null, "return_state": false, "stateful": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "go_backwards": false, "return_sequences": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, "merge_mode": "concat", "name": "bidirectional_18", "trainable": true}}, {"class_name": "RepeatVector", "config": {"trainable": true, "name": "repeat_vector_56", "n": 21}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "GRU", "config": {"bias_regularizer": null, "units": 128, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "implementation": 1, "name": "gru_151", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "recurrent_constraint": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "dropout": 0.0, "activation": "tanh", "recurrent_regularizer": null, "return_state": false, "stateful": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "go_backwards": false, "return_sequences": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, "merge_mode": "concat", "name": "bidirectional_19", "trainable": true}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "softmax", "units": 345, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_87", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true}}, "trainable": true, "name": "time_distributed_71"}}]}